app/views/records/_form.html.erb

        <div class="col-sm-5">
          <%= f.select :user_id, User.where(:contador => false , :admin => false, :caja => false, :estado => true).collect{ |p| [ p.nombre, p.id ] }, {prompt: false}, {class:'form-control'} %>
---
SELECT `users`.* FROM `users` WHERE `users`.`contador` = 0 AND `users`.`admin` = 0 AND `users`.`caja` = 0 AND `users`.`estado` = 1