app/controllers/clients_controller.rb

  def index
   @clients = Client.search(params[:search]).paginate(:per_page => 5, :page => params[:page])
---
SELECT  `clients`.* FROM `clients` ORDER BY `clients`.`id` ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `clients`

  def show
    @records = Record.where( :client_id =>(params[:id]) )
---
SELECT `records`.* FROM `records` WHERE `records`.`client_id` = 1

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`nombre`, `apellido`, `rut`, `email`, `telefono`, `created_at`, `updated_at`) VALUES ('sdf', 'sdfd', '17255894-1', 'sdf@ddf.cl', 245, '2017-03-10 19:17:22', '2017-03-10 19:17:22')

  def destroy
    if current_user.estilista?
      redirect_to clients_path
    else
    @client.destroy
---
DELETE FROM `clients` WHERE `clients`.`id` = 1

    def set_client
      @client = Client.find(params[:id])
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = NULL LIMIT 1