app/controllers/commission_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`contador` = 0 AND `users`.`admin` = 0 AND `users`.`caja` = 0 AND `users`.`estado` = 1 ORDER BY created_at DESC
---
  def index
  	@users = User.all.order('created_at DESC').where( :contador => false,:admin => false, :caja => false, :estado => true)

SELECT `records`.* FROM `records` WHERE `records`.`user_id` = 6 AND `records`.`pagado` = 1
---
  def employee
  	@total = 0
    if (params[:user_id] == nil)
      session[:user_id] = session[:user_id]
    else
      session[:user_id] = params[:user_id]
    end
  	@records = Record.where(:user_id =>session[:user_id] , :pagado => true)

UPDATE `records` SET `records`.`pagado` = 0 WHERE `records`.`user_id` = 5
---
  def pagar
    @record = Record.where( :user_id  => params[:user_id]).update_all( pagado: false)