app/controllers/inventaries_controller.rb

  def index
    @inventaries = Inventary.search(params[:search]).paginate(:per_page => 10, :page => params[:page])
---
SELECT  `inventaries`.* FROM `inventaries` WHERE (nombre LIKE '%sham%') LIMIT 10 OFFSET 0

  def create
    @inventary = Inventary.new(inventary_params)

    respond_to do |format|
      if @inventary.save
---
INSERT INTO `inventaries` (`nombre`, `codigo`, `cantidad`, `marca`, `created_at`, `updated_at`, `precio`) VALUES ('balsamo', '1231', 13, 'pantene', '2017-03-13 15:26:24', '2017-03-13 15:26:24', 5000)

  def update
    respond_to do |format|
      if @inventary.update(inventary_params)
---
UPDATE `inventaries` SET `nombre` = 'L´Oreal Absolute Repair Lipidium Acondicionador Reconstructor Intantáneo 150ml', `updated_at` = '2017-03-14 22:30:49' WHERE `inventaries`.`id` = 3

  def destroy
    @inventary.destroy
---
DELETE FROM `inventaries` WHERE `inventaries`.`id` = 3

    def set_inventary
      @inventary = Inventary.find(params[:id])
---
SELECT  `inventaries`.* FROM `inventaries` WHERE `inventaries`.`id` = 3 LIMIT 1