app/controllers/records_controller.rb

  def create
    @record = Record.new(record_params)

    #raise params.to_yaml
    respond_to do |format|
      if @record.save
---
INSERT INTO `records` (`client_id`, `service_id`, `user_id`, `anotacion`, `valor`, `comision`, `boleta`, `medio_pago`, `created_at`, `updated_at`) VALUES (1, 2, 5, 'lala1', 1234, 370, 1, '2', '2017-03-10 19:18:50', '2017-03-10 19:18:50')

  def destroy

    if current_user.estilista?
      redirect_to clients_path
    else
    @record.destroy
---
DELETE FROM `records` WHERE `records`.`id` = 5

    def set_record
      @record = Record.find(params[:id])
---
SELECT  `records`.* FROM `records` WHERE `records`.`id` = 5 LIMIT 1