app/controllers/services_controller.rb

SELECT  `services`.* FROM `services` WHERE (nombre LIKE '%lavado%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `services`
---
  def index
    @services = Service.search(params[:search]).paginate(:per_page => 10, :page => params[:page])

INSERT INTO `services` (`nombre`, `valor`, `created_at`, `updated_at`) VALUES ('sdfg', 345, '2017-03-10 18:40:38', '2017-03-10 18:40:38')
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

UPDATE `services` SET `nombre` = 'sdfgeeeee', `valor` = 34533, `updated_at` = '2017-03-10 18:40:49' WHERE `services`.`id` = 1
---
  def update
    respond_to do |format|
      if @service.update(service_params)

DELETE FROM `services` WHERE `services`.`id` = 1
---
  def destroy
    @service.destroy

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
    def set_service
      @service = Service.find(params[:id])