app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`estado` = 1
---
	def index
		@users = User.where( :estado => true)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `estado` = 0, `updated_at` = '2017-03-14 20:54:14' WHERE `users`.`id` = 3
---
 def destroy
     @usuario = User.find(params[:id])
     @usuario.update_attributes(estado: false)