app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`contador` = 0 AND `users`.`admin` = 0 AND `users`.`caja` = 0 ORDER BY created_at DESC
---
	def index
		@users = User.all.order('created_at DESC').where( :contador => false,:admin => false, :caja => false)